public class Main {

    /*
    Техническое задание:
    Пожарно-охранная система автотранспортного предприятия.

    Пульт пожарно-охранной системы расположен в помещении охраны предприятия.
    Территория предприятия огорожена забором. На ограждении установлены датчики пересечения периметра (срабатывание каждого датчика регистрируется в базе (дата, время).
    Доступ на территорию осуществяется через въезд со шлагбаумом. Каждое открытие шлагбаума регистрируется в базе (дата, время открытия; дата, время закрытия).
    На территории предприятия располагаются следующие отдельно стоящие здания:
    - административное здание (коридор, кабинет начальника, кабинет механика, кабинет бухгалтера, кладовая, санузел).
    - склад (кабинет кладовщика, помещение хранения запасных частей, помещение хранения ГСМ).
    - гараж (раздевалка водителей, санузел, столовая, стоянка автомобилей).
    - мастерские (раздевалка слесарей, санузел, ремонтный бокс).
    - помещение охраны (кабинет охраны, комната для отдыха).
    Охранный комплекс каждого здания включает в себя:
    - датчики движения в помещениях,
    - датчики проникновения через окна,
    - датчик проникновения через входную дверь,
    - пожарные извещатели в каждой комнате здания.
    Каждый элемент комплека имеет параметры: id, тип датчика, мето размещения, текущее состояние (выключен, в режиме ожидания, активен), дату перехода в каждое из состояний.
    Элементы охранного комплекса включаются после сдачи каждого здания под охрану.
    Элементы пожарного комплекса включены всегда.
    Срабатывание каждого элемента охранно-пожарного комплекса записывается в базу данных.
    У охранника есть возможность посмотреть текущее состояние каждого элемента комплекса, выгрузить из базы данные по истории срабатывания каждого элемента комплекса.

    */

    public static void main(String[] args) {
        System.out.println("Оставляю чистый проект");
    }
}
